[
    {
        "id": 517,
        "title": "A new chapter begins! The Chapeau de Paille crew reunited!",
        "description": "Luffy has grown up to become the master of Rusukaina Island after two years of intensive training. He bids farewell to the animals with whom he has become friends, then sets off again for the Sabaody Archipelago, where Rayleigh and the members of the Straw Hat Crew are waiting for him. Zoro gets there first and heads for the bar run by Shakky. He has changed a little over time, having lost an eye, and now sports a long scar on the left side of his face, giving him a darker side. A few days later, Nami appears, more beautiful than ever: she\u0027s let her hair grow. She\u0027s drinking alone in a bar, but is noticed by a crew posing as the real Straw Hats. Usopp, who has beefed up his muscles, arrives shortly afterwards and uses one of his Pop Greens to neutralize the fake crew. At the same time, Sanji approaches the archipelago after being transported by Ivankov\u0027s okamas. His appearance has also changed: he has grown a fine moustache and a small goatee, and his wick now covers his right eye instead of his left. Robin is one of the last to arrive at Sabaody. Her bangs are gone and she\u0027s become even more beautiful. As for Brook, he\u0027s become a world-famous singer known as \u0022Soul King Brook\u0022. Chopper has a new hat and is as fond of cotton candy as ever. As for Franky, he\u0027s upgraded his cyborg body. No sooner has he arrived in Sabaody than he\u0027s off to examine the Thousand Sunny. Luffy, the last crew member to arrive, unwittingly attracts the attention of the False Straw Hats.",
        "number": "n°517",
        "chapter": "Chap 598",
        "release_date": "2011-10-02",
        "arc": {
            "id": 36,
            "title": "Arc Return to Sabaody",
            "description": "Two years have passed since the Battle of Marineford, and the crew is back together on the Sabaody archipelago. Each has come back stronger, which is useful, because at the same time, pirate \u0022look-alikes\u0022 have usurped the identity of the Straw Hat crew and tried to recruit among the most dangerous pirates. Luffy and his crew are spotted by the Navy when they re-establish the truth, while the Navy tries to arrest the \u0022look-alikes\u0022. Then the head of the scientific division, Sentomaru, appears. Seeing the deception, Sentomaru defeats the latter very easily, before Luffy, Zoro and Sanji manage to destroy some Pacifistas in their path. The crew reunite on the boat, and head for Fishman Island, diving into the sea with Thousand Sunny then encased in a large bubble.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 518,
        "title": "Explosive situation! Luffy versus fake Luffy",
        "description": "Luffy is confronted by the fake Luffy and his gang. He easily neutralizes them using the powers Rayleigh taught him on Rusukaina Island. Meanwhile, Chopper stumbles across the fake Zoro, Sanji and Robin and mistakes them for the real ones. He begins to follow them until the fake Robin and the fox pretending to be him are kidnapped by two agents of the World Government. Meanwhile, the real Sanji goes on a market tour to supply Sunny with fresh produce. He learns from a fishmonger that Zoro had unintentionally embarked on a pirate ship bound for the New World. The swordsman, who had intended to fish to kill time, had taken the wrong boat. Noticing his mistake, he sliced the pirate ship in two before the stunned eyes of his friend the cook and the fishmonger.",
        "number": "n°518",
        "chapter": "Chap 598-599",
        "release_date": "2011-10-09",
        "arc": {
            "id": 36,
            "title": "Arc Return to Sabaody",
            "description": "Two years have passed since the Battle of Marineford, and the crew is back together on the Sabaody archipelago. Each has come back stronger, which is useful, because at the same time, pirate \u0022look-alikes\u0022 have usurped the identity of the Straw Hat crew and tried to recruit among the most dangerous pirates. Luffy and his crew are spotted by the Navy when they re-establish the truth, while the Navy tries to arrest the \u0022look-alikes\u0022. Then the head of the scientific division, Sentomaru, appears. Seeing the deception, Sentomaru defeats the latter very easily, before Luffy, Zoro and Sanji manage to destroy some Pacifistas in their path. The crew reunite on the boat, and head for Fishman Island, diving into the sea with Thousand Sunny then encased in a large bubble.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 519,
        "title": "The Navy soldiers go into action! Chapeau de Paille crew targeted",
        "description": "Robin arrives at Grove 17 and meets Franky near the Sunny. The Straw Hat ship is now equipped with a special coating that will enable it to travel through the depths of the sea. Meanwhile, on Grove 1, Sentoumaru decides to go to Sabaody accompanied by two Pacifistas. For his part, Chopper wants to save the False Robin on his own. He soon meets the real Nami and Usopp, who tell him that the people he met on the archipelago were in fact impostors. Meanwhile, Zoro and Sanji bicker while Luffy meets their look-alikes, Manjaro and Drip, who decide to take him to their leader, the False Luffy.",
        "number": "n°519",
        "chapter": "Chap 599-600",
        "release_date": "2011-10-16",
        "arc": {
            "id": 36,
            "title": "Arc Return to Sabaody",
            "description": "Two years have passed since the Battle of Marineford, and the crew is back together on the Sabaody archipelago. Each has come back stronger, which is useful, because at the same time, pirate \u0022look-alikes\u0022 have usurped the identity of the Straw Hat crew and tried to recruit among the most dangerous pirates. Luffy and his crew are spotted by the Navy when they re-establish the truth, while the Navy tries to arrest the \u0022look-alikes\u0022. Then the head of the scientific division, Sentomaru, appears. Seeing the deception, Sentomaru defeats the latter very easily, before Luffy, Zoro and Sanji manage to destroy some Pacifistas in their path. The crew reunite on the boat, and head for Fishman Island, diving into the sea with Thousand Sunny then encased in a large bubble.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 520,
        "title": "Gather round! The threat of fake straw hats!",
        "description": "On Grove 46, where a large number of pirates have gathered, Caribou spots a Navy soldier spying on them. Caribou spears him and the poor man dies instantly. Chopper, Usopp and Nami arrive on the Sunny, where they meet Robin and Franky. Franky demonstrates his new gadgets, showing them that he can pull a mini hand out of his large robotic hand and that he can change his hairstyle at will as soon as someone presses his nose for three seconds. For his part, Brook does a final song to close his singing tour, in which he explains why he has decided to live again as a pirate. Rayleigh arrives near the Sunny and asks Luffy\u0027s friends to make their way immediately to Grove 42 to prepare their ship for their new adventures. Meanwhile, the real Straw Hat, escorted by the fake Zoro and Sanji, arrives at Grove 46, where his fearsome doppelganger is waiting for him.",
        "number": "n°520",
        "chapter": "Chap 600",
        "release_date": "2011-10-23",
        "arc": {
            "id": 36,
            "title": "Arc Return to Sabaody",
            "description": "Two years have passed since the Battle of Marineford, and the crew is back together on the Sabaody archipelago. Each has come back stronger, which is useful, because at the same time, pirate \u0022look-alikes\u0022 have usurped the identity of the Straw Hat crew and tried to recruit among the most dangerous pirates. Luffy and his crew are spotted by the Navy when they re-establish the truth, while the Navy tries to arrest the \u0022look-alikes\u0022. Then the head of the scientific division, Sentomaru, appears. Seeing the deception, Sentomaru defeats the latter very easily, before Luffy, Zoro and Sanji manage to destroy some Pacifistas in their path. The crew reunite on the boat, and head for Fishman Island, diving into the sea with Thousand Sunny then encased in a large bubble.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 521,
        "title": "Let the battle begin! Show us the fruits of your training!",
        "description": "The False Straw Hat meeting continues until Sentoumaru arrives. Sentoumaru knocks out the False Luffy and reveals his true identity to the other pirates gathered on Grove 46. He then asks PX-5, the accompanying Pacifista, to detect the real Luffy. The cyborg does his job and fires several laser beams at the Straw Hat, who easily dodges the blows thanks to the power of his haki. He then engages the Gear Second on his left arm and hits PX-5 full force with a Haki-soaked Jet Pistol (Busoshoku No Haki). Leaving Grove 46, he meets up with the real Sanji and Zoro, who in turn shoot down PX-7, another Pacifista, with a single blow each. As they flee to avoid arrest by the Marine soldiers on the scene, Luffy suddenly stops to thank Rayleigh, who witnessed the scene with her friend Shakky. Luffy then renews the promise he made to himself: \u0022I\u0027m going to become the Lord of the Pirates\u0022, and sets off for the New World with his companions.",
        "number": "n°521",
        "chapter": "Chap 601",
        "release_date": "2011-10-30",
        "arc": {
            "id": 36,
            "title": "Arc Return to Sabaody",
            "description": "Two years have passed since the Battle of Marineford, and the crew is back together on the Sabaody archipelago. Each has come back stronger, which is useful, because at the same time, pirate \u0022look-alikes\u0022 have usurped the identity of the Straw Hat crew and tried to recruit among the most dangerous pirates. Luffy and his crew are spotted by the Navy when they re-establish the truth, while the Navy tries to arrest the \u0022look-alikes\u0022. Then the head of the scientific division, Sentomaru, appears. Seeing the deception, Sentomaru defeats the latter very easily, before Luffy, Zoro and Sanji manage to destroy some Pacifistas in their path. The crew reunite on the boat, and head for Fishman Island, diving into the sea with Thousand Sunny then encased in a large bubble.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 522,
        "title": "All aboard! Luffy on his way to the New World!",
        "description": "The members of the Straw Hat Crew are now all together at Grove 42, but three Navy ships are trying to stop them before they leave. That\u0027s when Boa Hancock enters the scene with his Kuja Pirates, Heracles who had trained Usopp, Perona who accompanied Zoro, Rayleigh, the giant bird from the Kingdom of Torino who brought Chopper back, Haredas who helped Nami and the Okamas who had escorted Sanji to the Sabaody Archipelago, allied to prevent the Navy forces from getting their hands on their friends. Enthusiastically, they dive into the ocean and set course for their next destination: the 10,000-metre-deep Island of the Fishmen!",
        "number": "n°522",
        "chapter": "Chap 602",
        "release_date": "2011-11-06",
        "arc": {
            "id": 36,
            "title": "Arc Return to Sabaody",
            "description": "Two years have passed since the Battle of Marineford, and the crew is back together on the Sabaody archipelago. Each has come back stronger, which is useful, because at the same time, pirate \u0022look-alikes\u0022 have usurped the identity of the Straw Hat crew and tried to recruit among the most dangerous pirates. Luffy and his crew are spotted by the Navy when they re-establish the truth, while the Navy tries to arrest the \u0022look-alikes\u0022. Then the head of the scientific division, Sentomaru, appears. Seeing the deception, Sentomaru defeats the latter very easily, before Luffy, Zoro and Sanji manage to destroy some Pacifistas in their path. The crew reunite on the boat, and head for Fishman Island, diving into the sea with Thousand Sunny then encased in a large bubble.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 523,
        "title": "The incredible truth. The story of the man who protected the Sunny",
        "description": "In the company of Shakky, Rayleigh, watching Luffy\u0027s departure for the Isle of Fishmen, recalls with emotion her first meeting with Gol D. Roger and his ambition to conquer the world. Roger and his ambition to conquer the world. Aboard the Sunny, wrapped in a special coating designed to undertake their underwater journey, the Straw Hats descend further and further into the depths of the sea, and the whole crew marvels at the beauty of the places they are passing through. Franky then recounts how Bartholomew Kuma protected their ship and saved them by separating them two years ago. His aim was to make each member of the Straw Hat Crew much stronger than they were before. As they continue their descent into the abyss, another pirate ship appears nearby. It is the ship of Caribou and his younger brother Coribou, who have come to kill them...",
        "number": "n°523",
        "chapter": "Chap 603-604",
        "release_date": "2011-11-13",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 524,
        "title": "Death struggle under the sea. The ocean demon makes its appearance",
        "description": "Caribou and his crew want to board the Sunny, but Meuh-Meuh, the sea cow towing their ship, recognizes Nami and remembers the beatings inflicted by Luffy and Sanji when they were in Arlong Park. Meuh-Meuh flees before the stunned eyes of Caribou\u0027s pirates, leaving Caribou alone aboard the Sunny. Caribou was easily captured by Franky, who had first threatened to throw him overboard. He is finally tied up by Zoro. Just when everyone thought their troubles were behind them, the legendary Kraken, a giant octopus, appears as they head downstream. Franky, Chopper and Robin use their new techniques to protect the Sunny from the attacks of this beast of the deep. For their part, Luffy, Zoro and Sanji, equipped with autonomous combat bubbles that enable them to fight easily underwater, rush to the front of the Kraken to chew it up. At the same moment, the sea monster attacks the Sunny. Chopper and Robin deploy all their talents to prevent their ship from being crushed to pieces by the Kraken\u0027s tentacles. Seeing that everything was looking up for his companions, Luffy took the opportunity to use a new fighting technique...",
        "number": "n°524",
        "chapter": "Chap 604-605",
        "release_date": "2011-11-20",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 525,
        "title": "Underwater shipwreck. Separate straw hats",
        "description": "While Sanji moves at incredible speed, using his famous Devil\u0027s Leg technique to strike a Kraken tentacle, Zoro uses a new technique to cut another tentacle. As for Luffy, he uses his new technique by doing a Gear Third with his right arm reinforced with Combative Fluid to make it even more powerful. After hitting the Kraken head-on, Luffy frees a shark, strangely dressed in a T-shirt, which was stuck in one of the Kraken\u0027s proboscis. The animal approaches his rescuers, and after thanking them for saving him, swims away. Still stunned by this disturbing discovery, the Straw Hat Crew and the sea monster fall into a waterfall. Luffy, Zoro and Sanji, still equipped with their autonomous combat bubbles, are separated from the rest of the crew and carried away. Their companions, aboard the Sunny, encounter various obstacles on their way, forcing Franky to use Burst Blows several times, which have the effect of considerably reducing the ship\u0027s special coating and their living space. After these misadventures, they pass over a volcanic zone and are on the verge of being swallowed up by a gigantic abyssal anglerfish. They owe their salvation to its master, a huge, human-looking sea monk, who sternly scolds his pet for daring to swallow a ship. But soon their savior freezes when a mysterious pirate ship suddenly appears.",
        "number": "n°525",
        "chapter": "Chap 605-606",
        "release_date": "2001-11-27",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 526,
        "title": "Underwater volcanic eruption! Propelled to the Island of the Fish-Men!",
        "description": "Vander Decken\u0027s pirate ship appears and he orders Wadatsumi, his \u0022handyman\u0022, to destroy the Sunny. Just as the giant was about to smash their ship to smithereens, the Kraken, tamed by Luffy, intervenes and battles the sea monk. Letting go of his grip, the Straw Hats take advantage of the situation to escape. Just as they thought they\u0027d got away with it, a volcanic eruption surprises them, forcing them to flee further ahead. Sunny, led by Kraken, manages to escape from the eruption. But when they reach the edge of a precipice, they all fall into a huge chasm that leads them to the Isle of the Fishmen. In the fall, a large boulder hits the Kraken\u0027s head, causing him to lose consciousness. After a long fainting spell, the Straw Hats discover that they have reached their destination, but that a group of mysterious individuals, riding strange mounts, are blocking their way to the island.",
        "number": "n°526",
        "chapter": "Chap 606-607",
        "release_date": "2011-12-04",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 527,
        "title": "Landing on the isle of Hommes-Poissons. The song of the beautiful mermaids",
        "description": "The Straw Hats have finally arrived at Fishman\u0027s Island, but are attacked by a group of Sea Monsters led by Fishmen calling themselves \u0022The New Fishman Crew\u0022. Franky sets off a Burst Blast to avoid capture, and Sunny is propelled onto the island. Arriving too fast, the lining of their ship bursts on contact with the protective barrier and all the members of the Chapeau de Paille crew are swept away by the current. The pirates soon wake up at Camie\u0027s and find that they have been split into two groups, each having been rescued by different mermaids. When Camie introduces Luffy, Chopper, Usopp and Sanji to her best friends, who are also beautiful mermaids, the latter succumbs to passion...",
        "number": "n°527",
        "chapter": "Chap 607-608",
        "release_date": "2011-12-11",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 528,
        "title": "Excitement at its peak! Sanji in danger!",
        "description": "Franky saves Robin from drowning, finds Nami and informs her that he has found a town. Meanwhile, the three sons of Neptune, Fukaboshi, Ryuboshi and Manboshi, arrive near the mermaids to look for the Straw Hats when Sanji suddenly starts bleeding from his nose continuously. Hammond of the New Crew of the Fishmen, who had already threatened our heroes when they were near the island, intervenes and repeats his proposal to Luffy, forcing him to join the crew of the Fishmen. When Luffy refuses, he tries to capture him, but the Straw Hat doesn\u0027t give in. Activating his Gear Second, he easily defeats his assailants. After these incidents, the crew leaves with Camie to try and find a compatible blood donor to treat Sanji. The young mermaid tells Luffy that Jinbe left Fish Island some time ago. At the same time, Zoro is apprehended by King Neptune\u0027s soldiers and taken to Ryugu Palace.",
        "number": "n°528",
        "chapter": "Chap 609",
        "release_date": "2011-12-18",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 529,
        "title": "The annihilation of Fish Island?! Shirley\u0027s prediction!",
        "description": "Luffy, Usopp and Chopper manage to find a blood donor for their comrade in the person of two Okama pirates, Splash and Splatter. Once Sanji is awake, Camie introduces Luffy and Usopp to Madame Shirley, her boss and the owner of the Café des Sirènes. She gives her employee the day off to show her new friends around the island. Enthusiastically, Camie sets off to see Pappug, her starfish, accompanied by Luffy and Usopp. They find Pappug with Brook outside a bar in Coral Hill. The starfish explains to his friends how he was able to rescue the squellette alive when it was in danger of drowning. After this emotional reunion, Camie and the Straw Hats head off to Pappug\u0027s, who turns out to be the creator and designer of a famous fashion line, Criminal. On the way, she explains that Vander Decken is a descendant of the famous pirate of the same name, and that he has been in love with Princess Mermaid for almost ten years, but that she does not want to marry him. Camie then shows them a candy store where the sweets are made to protect the island from outside intruders, thanks to the presence of Big Mom, a prominent member of the Four Emperors, who is very fond of them. As the Straw Hats make their way to Pappug\u0027s home, Madame Shirley makes a prediction to all her fellow citizens that Luffy will destroy Fishman Island in the very near future.",
        "number": "n°529",
        "chapter": "Chap 610",
        "release_date": "2011-12-25",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 530,
        "title": "King of Fish Island. Neptune. God of the Oceans!",
        "description": "A crew of human pirates, led by crab-handed Gyro, try to escape from the Fishman District. But Hody Jones, captain of the New Fishmen Crew, takes a few steroid pills and sets off in pursuit. Meanwhile, Luffy, Usopp and Brook find Nami in Pappug\u0027s ready-to-wear store. Suddenly, Neptune, ruler of the Isle of Fishmen, arrives on the back of his whale, accompanied by the shark that the Straw Hat Crew had freed from the Kraken, and invites the latter to come to his palace, much to the astonishment of Camie and Pappug. Hody, for his part, continues to attack the fleeing pirates, demonstrating his superhuman strength by ransacking their ship. Without the slightest hint of mercy, he shows his savagery and decides to let the survivors reach the surface so that they can tell their fellows about the horror they experienced in the depths of the sea. At the same time, in the Fishman District, one of Hody\u0027s accomplices explains to his comrades that a steroid pill is capable of increasing strength tenfold, but considerably reduces life expectancy.",
        "number": "n°530",
        "chapter": "Chap 611",
        "release_date": "2012-01-08",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 531,
        "title": "Guided by the recognizing shark! Direct to Ryugu Palace",
        "description": "While Caribou uses the powers of his Demon Fruit to capture Ishilly and her mermaid friends for sale on the Sabaody slave market, Luffy and his companions make their way to King Neptune\u0027s palace, where Zoro is already. While waiting for the feast that the ruler of the Isle of Fishmen had promised them in gratitude for having saved Megalo, his beloved daughter\u0027s pet shark, Luffy takes the opportunity to wander through the corridors of Ryugu Palace and ends up accidentally entering the bedroom of the beautiful Mermaid Princess Shirahoshi.",
        "number": "n°531",
        "chapter": "Chap 612",
        "release_date": "2012-01-15",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 532,
        "title": "Weepy and weepy! The mermaid princess of the shell tower",
        "description": "After Shirahoshi, the Mermaid Princess, learns that her shark, Megalo, has been saved by Luffy, she starts to like him and asks him lots of questions. She tells him that Van Der Decken is attacking her with the power of the \u0022Targeting Fruit\u0022, because she refused his marriage proposal. We learn that he used his demon fruit to target her when she was still a child at the time of her mother\u0027s death. After this discussion, Luffy offers Shirahoshi the chance to walk outside the tower and protect her, come what may. At the same time, Neptune\u0027s soldiers try to arrest the other members of the Straw Hat crew. For his part, Van Der Decken forms an alliance with Hody Jones to reduce the Ryugu Palace to rubble and kill King Neptune.",
        "number": "n°532",
        "chapter": "Chap 632",
        "release_date": "2012-01-22",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 533,
        "title": "State of emergency. Ryugu Palace invaded",
        "description": "Zoro, who has escaped from his cell, takes Neptune and his men hostage after defeating the King of Fish Island. Arriving at the palace entrance, Prince Fukaboshi and his two brothers, Princes Ryuboshi and Manboshi, pass Zoro a message from Jinbe intended for Luffy, saying that the former Pirate of the Sun formally forbids him to confront Hody Jones and find him urgently in the Marine Forest. Meanwhile, Chopper and Sanji prepare to take on some of King Neptune\u0027s guards. As for Luffy, he prepares to take Shirahoshi to the Marine Forest, a place she\u0027s dreamed of since she was a little girl, by hiding her in the mouth of Megalo, his pet shark. Just as they\u0027re about to go for a walk, human pirates in Hody\u0027s pay are dispatched by Vander Decken, who has used his power, and come crashing through the huge door of Princess Shirahoshi\u0027s room in the Shell Tower.",
        "number": "n°533",
        "chapter": "Chap 614",
        "release_date": "2012-01-29",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 534,
        "title": "Ryugu Palace shaken! Shirahoshi\u0027s kidnapping",
        "description": "On learning that Princess Shirahoshi is no longer in her room, Brook and the Minister of the Right go to warn King Neptune, but are held prisoner by human pirates sent by Hody Jones through Vander Decken. A few hours earlier, Octo, trying to persuade Hody and Vander Decken to abandon their sinister plan to overthrow the Ryugu Kingdom, falls victim to a demonstration of Vander Decken\u0027s \u0022Targeting Fruit\u0022. Trying to escape, he is hit by several arrows and arrives badly wounded at Coral Hill in front of Sanji and Chopper, who had been fighting against the king\u0027s guards. Meanwhile, at Ryugu Palace, human pirates invade the courtroom and try to open the palace gates to Hody Jones and his gang, but Zoro interferes. Meanwhile, in the Marine Forest, Tom\u0027s younger brother Den explains to Franky that the area is a ship graveyard. In the distance, the cyborg notices a mysterious Fishman sitting in the corner. Den informs him that this is Jinbe, a Great Corsair Captain. The latter remembers with nostalgia the great Queen Otohime...",
        "number": "n°534",
        "chapter": "Chap 614-615",
        "release_date": "2012-02-05",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 535,
        "title": "Hody goes on the attack! The beginning of revenge",
        "description": "Robin, who has discovered the existence of a Poneglyph on Fish Island, wants to go to the Marine Forest to study it. Along the way, she encounters soldiers from Neptune\u0027s army who want to arrest her for being a member of the Crew of the Straw Hat. But the young woman doesn\u0027t give in and easily defeats her opponents using her powers. Meanwhile, Franky is in the Marine Forest, near the Sunny that ran aground there, with Den, the younger brother of Tom, his former mentor. In the distance, he spots Jinbe meditating. At the same time, the human pirates sent by Vander Decken are all defeated by Zoro. But discreetly, one of them manages to engage the opening system of the palace door, allowing the leader of the New Crew of Fishmen to easily penetrate the palace. Decken, Hody and his men storm Ryugu Palace, finding the guards tied up and the king in chains. The disappearance of Shirahoshi, who had in fact left with Luffy, triggers the anger of Neptune, who believes that Vander Decken is the real kidnapper. The latter immediately sets off in search of the princess on a giant coral he has touched with his \u0022Targeting Fruit\u0022.",
        "number": "n°535",
        "chapter": "Chap 616",
        "release_date": "2012-02-12",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 536,
        "title": "The final battle of the Ryugu Palace! Zoro versus Hody",
        "description": "At Ryugu Palace, Neptune begs someone to protect his daughter. Drunk with power, Hody mocks him, saying he was just a weak king. The captain of the New Crew of Fishmen confessed that he had joined the royal army with the sole aim of learning all military techniques. His only ambition was to revive Arlong\u0027s dream. Nami was shocked by this confession and, with Camie\u0027s help, fled the palace to seek help at the Marine Forest, where Jinbe had arranged for Luffy to meet him. The battle begins and, as he confronts the Straw Hats, Hody destroys a wall of the palace, creating a breach that completely floods the courtroom. Zoro asks his companions and the king, who has been released from his chains, to flee while he remains alone to prevent Hody from pursuing them. The fight between Hody and Zoro is fierce. But the Fish Man is in his element and forces the swordsman to fight him underwater. On his way to the Marine Forest, Megalo unwittingly spits out Princess Shirahoshi, who appears before the inhabitants of Fishman Island. Thinking that the members of the Straw Hat Crew were responsible for kidnapping the princess, they try to stop Luffy, Sanji and Chopper. The latter were busy treating Octo, who is immediately accused of complicity.",
        "number": "n°536",
        "chapter": "Chap 617",
        "release_date": "2012-02-19",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 537,
        "title": "Protect the princess at all costs! Tough Decken!",
        "description": "Hearing the name of a princess, Sanji turns and, under the beauty of Princess Shirahoshi, turns to stone. While Luffy and his friends are tied up, Vander Decken appears in the distance on a flying coral and tries to attack Shirahoshi. But the pirate is easily defeated by Luffy\u0027s Gear Second, who has confronted him hand and foot. At the same time, Nami leaves Ryugu Palace, carried by Camie, to find Jinbe in the Marine Forest, abandoning Zoro. The latter continues alone in his battle against Hody, at the end of which he triumphs after using a famous one-saber technique, the \u0022Lion Dance\u0022.",
        "number": "n°537",
        "chapter": "Chap 618",
        "release_date": "2012-02-26",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 538,
        "title": "The defeat of the Straw Hat pirates! Hody conquers Ryugu Palace",
        "description": "Zoro finishes his fight against Hody. But his acolytes swallow steroid pills, enabling them to stand up to him. King Neptune, realizing the gravity of the situation, decides to retreat and creates a sea current so that he and his men can escape. Unfortunately, Hody, under the influence of drugs, manages to hold the king by the tail, as do Zoro, Usopp and Brook, who have latched onto his beard. Meanwhile, Luffy, after Shirahoshi frees him from his bonds, takes the Mermaid Princess, Chopper, Sanji and Octo with him on his escape, but has to face the hideous Wadatsumi, Vander Decken\u0027s henchman, before arriving at the Marine Forest. Using one of his most powerful fighting techniques, the Straw Hat hits him right in the jaw and manages to knock out one of his teeth, as his master looks on in annoyance. After this misadventure, the little group, climbing onto Megalo, leave Coral Hill and finally arrive at the Marine Forest, where they meet Jinbe, Franky and Tom\u0027s younger brother Den. They are soon joined by Nami and Camie, who have managed to escape from the beleaguered Ryugu Palace. They all listen attentively to Jinbe\u0027s story, which reveals terrible secrets about Arlong and the young sailor\u0027s past in East Blue.",
        "number": "n°538",
        "chapter": "Chap 619",
        "release_date": "2012-03-04",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 539,
        "title": "Haunted ties resurface! Nami and the crew of the Fishmen!",
        "description": "Robin discovers the Poneglyph of the Isle of the Fishmen as the soldiers of the royal guard, who have escaped from the palace, emerge alive. At the same time, every corner of the island is invaded by Hody Jones\u0027 men, who want the inhabitants to crush the photo of the late Queen Otohime with their feet. Meanwhile, in the Marine Forest, Jinbe begins to recount Arlong\u0027s past, bringing back painful memories to Nami that the young woman thought had been buried forever.",
        "number": "n°539",
        "chapter": "Chap 620",
        "release_date": "2012-03-18",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 540,
        "title": "The hero who saved the slaves! The TIger adventurer",
        "description": "Jinbe tells the story of how, sixteen years ago, Queen Otohime, Princess Shirahoshi\u0027s mother, did her best to make the Fish-Men live side by side with humans. But this desire for peace was ruined by Fisher Tiger, who wanted to free his fellow fish on the surface, where they were enslaved. At the time, Jinbe was a member of the royal guard. He knew Arlong and often came into conflict with him. But when he learned that Tiger had attacked Marie-Joie and freed the slaves, including Boa Hancock and his two sisters, Boa Marigold and Boa Sandersonia, he abandoned his duties to join the Crew of Sun Pirates that Tiger had founded to conquer the whole world and fight against the human race.",
        "number": "n°540",
        "chapter": "Chap 621-622",
        "release_date": "2012-03-25",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 541,
        "title": "Kizaru enters the scene! The trap closes in on Tiger!",
        "description": "Jinbe continues the story of Otohime and Fisher Tiger. While the Queen was desperately trying to collect signatures so that the Fish-Men could one day cohabit with humans in harmony, the Sun Pirates made a name for themselves on the surface of the oceans. Their reputation outstripped their own, and even reached the ears of Vice-Admiral Borsalino, who could not deny that these new forbears of a different kind would upset the balance of the world if they were not stopped. Three years after Tiger attacked Terre Sainte de Marie-Joie, the Sun Pirates met Koala, an 11-year-old girl. She was a former human slave whom Tiger had freed. The captain agreed to take her aboard his ship. Still traumatized by her past, the little girl behaved like a slave, always smiling and never complaining so as not to be killed by the Fish-Men. This attitude exasperated Tiger so much that he decided to cover the slave mark Koala had on her back with the symbol of the Sun Pirates, to show her that the Pisces-Men were very different from the Celestial Dragons, the little girl\u0027s former torturers. He even promised to take her back to her native island. Moved to the very depths of her being, Koala was at last able to express the emotions she had had to repress for so many years, and began to weep loudly as she thanked her saviors.",
        "number": "n°541",
        "chapter": "Chap 620-621-622",
        "release_date": "2012-04-01",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 542,
        "title": "Team in training! Save Chopper",
        "description": "Toriko and Komatsu are fishing when Komatsu catches a Harusame. After Toriko has defeated the huge, whale-sized fish, Luffy appears from the animal\u0027s gaping mouth. The two friends can\u0027t believe their eyes when they see the Straw Hat they\u0027ve met before. But soon, the Sunny arrives to find its unfortunate captain. Toriko and Komatsu discover that Chopper, the ship\u0027s doctor, is seriously ill. To cure the little reindeer, our heroes must find the \u0022Fruit of the Sea Fruit\u0022 and feed it to him, so that he can regain his health. So Luffy and Toriko team up once again, and together they go to T-Chuka Island in search of the mysterious fruit that will save Chopper\u0027s life.",
        "number": "n°542",
        "chapter": "",
        "release_date": "2012-04-08",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 543,
        "title": "The end of a hero - Tiger\u0027s secrets",
        "description": "Jinbe continues his story. With the exception of Arlong, all the Sun Pirates adopted Koala as one of their own. During the trip, Jinbe played with the child, realizing that his hatred of humans was probably due to his fear of the unknown. As he grew closer to Koala, the Fish-Man realized that Queen Otohime\u0027s arguments were justified, and that a rapprochement between Fish-Men and humans could be possible. Using an Eternal Pose to locate the girl\u0027s native island, Fisher Tiger decided to take her back to her village himself. But the suspicious villagers had warned the Navy forces, commanded by Rear Admiral Strawberry, of the Fishmen\u0027s imminent arrival on their island. They were ambushed. Their ship was badly damaged, but many managed to escape after rescuing their captain from the Navy\u0027s clutches. Tiger, however, was seriously wounded during the skirmish, and succumbed to his injuries on board a Navy ship his men had managed to commandeer. Refusing to be transfused with human blood, which was compatible with his own, he forced his crew to promise him, before his death, that they would no longer hate humans, and that they would not pass on this hatred to future generations of Fishmen, even after confessing his painful past as a slave.",
        "number": "n°543",
        "chapter": "Chap 623",
        "release_date": "2012-04-15",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 544,
        "title": "Crew split. Jinbe vs Arlong",
        "description": "Arlong is furious at Tiger\u0027s death and, rather than choose to obey his captain\u0027s last wish, decides to travel to Koala\u0027s native island to take revenge on the humans who had betrayed them. Once there, he attacked the crews of the Navy ships stationed on the island, but was defeated by Vice-Admiral Borsalino, future Admiral Kizaru, who had been waiting for his arrival. He overpowered him with a beam of light, slightly injuring him. Following this forceful arrest, Arlong was interrogated at length and then imprisoned at Impel Down. Jinbe, who now had a free hand, became \u0022The First Son of the Sea\u0022, i.e. captain of the Sun Pirates. Recognized as a major threat to the Navy, he was offered the position of Grand Corsair. Fishman accepts so that he can free Arlong, who has a fierce hatred of humans, and let the Sun Pirates return home in peace. After his release, Arlong is furious at this arrangement and violently attacks Jinbe, who defeats him in single combat. Following this altercation, the Sun Pirates split into three groups who went their separate ways: the first was led by Jinbe, the second by Arlong and the third by Macro, a dissident pirate.",
        "number": "n°544",
        "chapter": "Chap 523-524",
        "release_date": "2012-04-22",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 545,
        "title": "The island of the Fish-Men shaken. The shipwrecked Celestial Dragon",
        "description": "Jinbe continues his tale of how he freed the slaves and became a Great Corsair Captain. Meanwhile, Queen Otohime learned that a Celestial Dragon, named Miosgard, had arrived on the Isle of the Fishmen in search of escaped slaves. This human was the only survivor of his crew. His ship had arrived from the surface in a bad way. As the subjects of the Ryugu Kingdom administered first aid to Miosgard, he began to insult them, demanding that they bring him a mask to avoid breathing the same air as them. Full of rage, the Celestial Dragon orders his former slaves to return with him to the surface. This arrogance exasperates former Sun Pirates like Aladdin, who have returned to live in peace on the Isle of the Fishmen, and want to kill this detestable character. But Queen Otohime arrives on the scene and stands between her subjects and the Celestial Dragon, who takes advantage of the situation to take the sovereign hostage by aiming the barrel of his golden pistol at the temple of Princess Shirahoshi\u0027s mother, who is present with her brothers, if his demands are not met...",
        "number": "n°545",
        "chapter": "Chap 624-625",
        "release_date": "2012-04-29",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 546,
        "title": "Tragedy! The fatal shot",
        "description": "Queen Otohime has voluntarily agreed to go with Miosgard to the surface, despite the reluctance of those closest to her, led by King Neptune. She took advantage of this trip to make known the Fish-Men\u0027s desire to live in harmony with humans at a summit organized by the World Government. A week later, the Queen returned from her long journey to the surface with some very good news: a letter written by the Celestial Dragons guaranteeing the beginning of a cordial understanding between the Pisces-Men and humans. Just as all seemed to be going well, the sovereign\u0027s petitions mysteriously caught fire in the three urns in which they were stored, and someone fired a shot at Otohime. Otohime, shot through the heart, succumbed and, before dying, forced her three sons, Princes Fukaboshi, Ryuboshi and Manboshi, to promise to protect their little sister, Shirahoshi, who had the gift of communicating with the Sea Kings, immense sea creatures. But what the sovereign didn\u0027t know was that the Mermaid Princess, who was only 6 at the time, was about to be stalked by the pirate Vander Decken, who had fallen madly in love with her and dreamed of marrying her despite her young age.",
        "number": "n°546",
        "chapter": "Chap 625-626",
        "release_date": "2012-05-06",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 547,
        "title": "Back in the present. Hody takes action",
        "description": "Queen Otohime dies and with her the dream of one day making peace with humans. Hody Jones, who at the time belonged to Neptune\u0027s royal guard, found the shooter. It was a human whom the Man-Fish proudly displayed as a trophy to his fellow creatures after killing him with the still-warm murder weapon. Jinbe\u0027s story ends with the Queen\u0027s funeral, to which the entire royal family was invited, with the exception of the young Princess Shirahoshi, locked in the Shell Tower, and her brothers. Back to the present. Jinbe asks Nami to forgive him for having ordered Arlong\u0027s crimes in East Blue when a video snail phone broadcasts a speech by Hody, who introduces himself to the Pisces as their new sovereign in place of King Neptune.",
        "number": "n°547",
        "chapter": "Chap 627",
        "release_date": "2012-05-13",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 548,
        "title": "The kingdom in danger. The order to execute Neptune",
        "description": "During his speech, Hody announces his Machiavellian plan to execute King Neptune and take his place. He also informs his people that he has locked up some members of the Straw Hat Crew - Zoro, Usopp and Brook - in an elevated cage in a room of Ryugu Palace. Hody, drunk with power, orders the room to be flooded to drown them. But Luffy doesn\u0027t hear of it and decides to go to their rescue. But Jinbe steps in to prevent the young pirate from going to the palace to fight an opponent more powerful than himself.",
        "number": "n°548",
        "chapter": "Chap 628",
        "release_date": "2012-05-20",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 549,
        "title": "The discode. Luffy vs Jinbe",
        "description": "Jinbe is forced to fight Luffy to prevent him from fighting Hody Jones. Fortunately, the fight between the two pirates is quickly stopped by Sanji and the unexpected intervention of Robin, who had returned from her exploration of the Marine Forest. Meanwhile, Hody orders his men to evacuate Ryugu Palace, with Neptune in chains, to the Place de la Thon-corde, where the execution of the king of Fish Island is to take place. At the same time, still imprisoned in the cage with Zoro and Usopp, Brook demonstrates a new technique for separating his mind from his body. Thanks to this prodigy, the living skeleton then seeks the help of Pappug, Camie\u0027s starfish, to rescue his friends still imprisoned, while Prince Fukaboshi and his two brothers, after defeating the Sea Monsters that serve as mounts for Hody Jones\u0027 men, travel, with the help of Ryugu, their enormous pet regalecid, to the Place of the Tuna Rope where their father is to be put to death in three hours\u0027 time. Meanwhile, Jinbe, having recovered from his wounds, once again challenges Luffy to a duel in order to dissuade him from fighting Hody. He fears that if the Straw Hat takes on the fearsome captain of the New Crew of Fishmen in single combat, it will prove to his fellow creatures that humans are a very violent and untrustworthy race...",
        "number": "n°549",
        "chapter": "Chap 629",
        "release_date": "2012-05-27",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 550,
        "title": "The Hody disaster! The evil power of drugs!",
        "description": "While Jinbe and Luffy battle it out in the Marine Forest to see who can stop their enemy, all Hody Jones\u0027 subordinates in different parts of Fish Island abuse their power by molesting their fellow creatures who disagree with them. Once their deeds are done, they make their way to the Place de la Thon-corde, where King Neptune is to be executed. The Princes Fukaboshi, Ryuboshi and Manboshi are also there to prevent their father\u0027s death. Meanwhile, Hody Jones, having left Ryugu Palace and on his way to Thon-corde Square, feels a searing pain in his chest resulting from the sword blow Zoro had inflicted on him at the end of their last fight. To alleviate the pain, the captain of the New Crew of Fishmen swallows a huge quantity of steroids, which transform him into a powerful monster boiling with rage.",
        "number": "n°550",
        "chapter": "Chap 629-630",
        "release_date": "2012-06-03",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 551,
        "title": "The final battle begins! Place de la Thon-corde",
        "description": "Neptune\u0027s army, which had fled Ryugu Palace in a hurry, leaving their beloved sovereign behind, launches a counter-attack against Hody. At the same time, Vander Decken is heartbroken at not being loved by Princess Shirahoshi and decides to kill her in revenge. On his way to the Place de la Thon-corde, where the execution of the King of the Fishmen is to take place, Hody is confronted by the men of the Minister of the Right, whom he savagely annihilates using his superhuman strength. Meanwhile, Princes Fukaboshi, Ryuboshi and Manboshi suffer a crushing defeat at the hands of Hody\u0027s steroid-addled officers. At the same time, Jinbe, who has defeated Luffy, rushes off with the Mermaid Princess to take part in the battle. With Megalo\u0027s help, Shirahoshi and Jinbe leave the Marine Forest to face Hody in a merciless battle.",
        "number": "n°551",
        "chapter": "Chap 631",
        "release_date": "2012-06-10",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 552,
        "title": "Terrible revelation - The truth about Otohime\u0027s murder",
        "description": "On their way to defeat Hody, Jinbe, Princess Shirahoshi and Megalo are captured by members of the New Fishmen Crew. They are ruthlessly led to Tuna Rope Square, where they see King Neptune and Princes Fukaboshi, Ryuboshi and Manboshi, chained and awaiting execution. When Madame Shirley reveals to Hody Jones that it is Luffy who will destroy the Isle of the Fishmen, the captain of the forbans, vexed to know that it was not he who had the fate of the Ryugu Kingdom in his hands, eliminates the prophetess by firing an explosive bullet that sends her into chaos. Then, in the meantime, Hody Jones confesses to all his men gathered in the square - at least 100,000 outlaws, all from the Fishman District - that he is the one responsible for the assassination of Queen Otohime. This revelation fills all the inhabitants of Fishman Island with horror, including Shirahoshi, who already knew the true identity of his mother\u0027s murderer. Meanwhile, Decken, his heart filled with bitterness and hatred for the Mermaid Princess, decides to kill her by hurling the Noah Ark at Fish Island after touching it with his hand.",
        "number": "n°552",
        "chapter": "Chap 632",
        "release_date": "2012-06-17",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 553,
        "title": "Shiraoshi\u0027s tears. Luffy enters the scene!",
        "description": "Shirahoshi tells Hody that Megalo, his pet shark, witnessed the assassination of Queen Otohime. It was he who had revealed the murderer\u0027s name to her. Yet, even knowing this, the young princess preferred to keep silent to respect the promise her late mother had made to her four children. After hearing Shirahoshi\u0027s story, the leader of the New Crew of Fishmen laughed at her and ordered that King Neptune and Princes Fukaboshi, Ryuboshi and Manboshi be executed on the spot. At the same time, Madame Shirley, despite her injury, informs a group of children that her forecasts do not give the exact date for the destruction of the Isle of the Fish-Men, and soon its inhabitants start calling on Luffy to take action, since their fate is now sealed. For her part, Princess Shirahoshi pleads with all her might for the Straw Hat to show up and save the life of her father, who is about to be beheaded by Hody himself. Luffy doesn\u0027t hesitate. Hiding in Megalo\u0027s belly, he suddenly emerges from the shark\u0027s stomach and delivers a tremendous kick that sends Hody crashing to the mat. At the same moment, Nami appears, warning Robin that she has recovered the Celestial Dragons\u0027 letter to Queen Otohime and the keys to the prisoners\u0027 chains. The young archaeologist, before Shirahoshi\u0027s astonished eyes, frees her and her brothers. The latter looked after their father, and the four of them buried themselves on the back of Hoe, the royal whale in the eyes and beard of their captors. Suddenly, the other members of the Straw Hat Crew arrive aboard the Sunny, suspended in the sky by a huge air bubble. Franky suddenly activates the Gaon cannon, whose deflagration causes chaos in the ranks of their enemies. Once their ship has landed, the battle between the Straw Hats and the new Fishman Pirates is imminent. Robin takes advantage of this moment to set Jinbe free, who is delighted to join Luffy in battle against Hody Jones and his men, before the stunned eyes of the inhabitants of Fishman Island.",
        "number": "n°553",
        "chapter": "Chap 633",
        "release_date": "2012-06-24",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 554,
        "title": "Into the fray! The crew of the Chapeau de Paille take on 100,000 enemies!",
        "description": "The inhabitants of Fishman\u0027s Island are both astonished and delighted by the arrival of the Straw Hats in Tuna Rope Square. Jinbe reveals that he has made a deal with Luffy to become the island\u0027s hero, while demonstrating that his friend was not by nature a brutal man. For their part, Brook, Zoro and Usopp explain how they managed to escape from Ryugu Palace with Pappug\u0027s help. After these explanations, Luffy eliminates half of Hody\u0027s men using the Haki of Kings, which he seems to have mastered perfectly. Then, thwarting the Fishman\u0027s plans, he shouts loud and clear that he, and not Hody, will be the true King of the Pirates.",
        "number": "n°554",
        "chapter": "Chap 634",
        "release_date": "2012-07-01",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 555,
        "title": "A plethora of techniques! Zoro, Sanji, it\u0027s your turn!",
        "description": "The battle between the members of the Straw Hat Crew and the 100,000 men under the command of Hody Jones rages on. Having eliminated half of his opponents thanks to the powers Luffy had acquired on Rusukaina Island during the last two years of intensive training, the remaining 50,000 soldiers are under attack from the Straw Hat\u0027s friends, who in turn reveal their incredible fighting skills to the inhabitants of Fishman Island. Zoro creates a tornado of blades that eliminates many of his attackers, while Sanji demonstrates a new technique that enables him to fly through the air.",
        "number": "n°555",
        "chapter": "Chap 634-635",
        "release_date": "2012-07-08",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 556,
        "title": "Sunny\u0027s secret brands! Opening",
        "description": "Luffy and his crew continue to fight relentlessly. While Brook and Robin demonstrate new techniques by defeating their opponents, Franky leads Nami, Chopper, Usopp and Pappug to discover Sunny\u0027s latest modifications and try out the two new secret weapons he had stored in decks 4 and 5, the Black Rhino FR-U 4 and the Brachio Tank V. Now that the Place de la Thon-corde has become a huge battlefield, Hody decides to send the Kraken to attack the Crew of the Chapeau de Paille. But just as it\u0027s about to strike, the sea monster remembers Luffy and his friendship. Disobeying the orders given to him by the Fishman, Surume decides to do his best to protect Princess Mermaid Shirahoshi and the Thousand Sunny from the attacks of the New Fishman Crew. As for Luffy, he\u0027s about to attack the rest of the Fishman Pirates on his own...",
        "number": "n°556",
        "chapter": "Chap 634-635-636",
        "release_date": "2012-07-15",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 557,
        "title": "General Franky, the iron pirate. In action!",
        "description": "The battle in the Place de la Thon-corde continues to rage. The officers of the New Crew of Fishmen Pirates begin to attack. As Chopper tries to subdue Daruma, he knocks Franky\u0027s weapons into a hole. Far from being discouraged, the cyborg demonstrates his new ability by combining two of Sunny\u0027s weapons on himself, making him a formidable war machine. At the same time, Hody orders the Kraken to kill Shirahoshi or he\u0027ll murder Surume\u0027s brother. Just then, Luffy arrives and prevents the Fishman from carrying out his plan. Reminding him that he and the Kraken had become friends, the Straw Hat proudly stands up to Hody and confronts him, unaware that the Noah is moving ever closer to the Isle of the Fishmen to annihilate him.",
        "number": "n°557",
        "chapter": "Chap 636",
        "release_date": "2012-07-29",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 558,
        "title": "Noah approaches! Crisis caused by the destruction of Fish Island!",
        "description": "Luffy begins his battle against Hody using his new Fluid-enhanced attacks. Meanwhile, the Noah, scarred by Decken\u0027s touch with his power, comes dangerously close to Fishman\u0027s Island so that the huge ship crashes into Shirahoshi and the island\u0027s inhabitants. Vander Decken, comfortably aboard the ship, was ready to do anything to kill the Mermaid Princess, even if it meant losing his own life. The arrival of this immense ark causes panic among the inhabitants of Ryugu Kingdom, who begin to flee in all directions. At the same time, Hody discovers the true nature of his partner\u0027s plan. He feels betrayed and immediately becomes furious. Mad with rage, Hody pursues Decken, who has ruined all his plans, leaving Luffy to his fate. Luffy decides to follow him and protect Princess Shirahoshi, who has just been wounded in the shoulder by a dagger thrown at her by Decken. After asking Sanji to stay with the islanders to protect them, he sees Princess Mermaid, writhing in pain, moving as quickly as possible away from Fish Island. The Straw Hat uses his elastic man powers to climb aboard the Noah after Jinbe hands him a Bubble Coral so the young pirate can fight easily underwater.",
        "number": "n°558",
        "chapter": "Chap 636-637",
        "release_date": "2012-08-05",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 559,
        "title": "Hurry up Luffy! Shirahoshi in a desperate situation",
        "description": "With Sanji\u0027s help, Luffy successfully pierces the bubble surrounding the Noah. He quickly grabs hold of one of the huge arch\u0027s chains and begins to climb up to join Hody, who is already aboard the ship. Some of the inhabitants of Fishmen\u0027s Island try in vain to stop the huge ship, which continues to pursue Princess Shirahoshi by pulling on her chains, but Hody Jones doesn\u0027t give them the chance. Abandoning the ship, he attacks them without mercy. Seeing this, the Mermaid Princess decides to take to the high seas through a passageway leading to it, in order to lure the Noah and Hody away from the Ryugu Kingdom. Still clinging to one of the ship\u0027s chains, Luffy suddenly runs out of air and activates the Bubble Coral given to him by Jinbe before leaving to avoid drowning. Unfortunately, Hody notices his presence and starts fighting him. As the Fishman is at ease in the water, he bursts his opponent\u0027s air bubble and soon Luffy is on the verge of succumbing. The Straw Hat is saved in extremis by Prince Fukaboshi, who has come to his rescue. Both witness a disturbing scene. While Princes Manboshi and Ryuboshi order their younger sister to swim higher and protect her from Decken, Hody Jones confronts Vander Decken and stabs him with his trident. The captain of the Flying Dutchman succumbs to his wounds and soon the Noah, freed from Decken\u0027s Targeting Power, begins a dizzying fall, heading dangerously towards Fishman Island.",
        "number": "n°559",
        "chapter": "Chap 638",
        "release_date": "2012-08-12",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 560,
        "title": "The battle begins! Luffy versus Hoddy!",
        "description": "Hody Jones, after stabbing Decken, catches up with Shirahoshi to kill her, as she is the only person who can summon the Sea Kings. Once again, the young mermaid is saved by Luffy and his brother, Prince Fukaboshi. Meanwhile, on the Isle of Fishmen, Wadatsumi, Vander Decken\u0027s sea monk, defeats the Kraken using the powers of drugs before attacking Jinbe. Fortunately, the valiant Corsair Captain doesn\u0027t give in and administers a lightning kick to Wadatsumi just as he\u0027s about to throw a punch. Having hurt his hand badly, he collapses heavily to the ground, and the blast of his fall knocks over Nami, who was fighting Hody\u0027s men with her climatic stick. Sanji witnesses the scene and, fulminating with rage, kicks the monster in the head, who doesn\u0027t understand the cause of his behavior. He soon sees Sanji and Jinbe standing up to fight together. While Robin uses the powers of his Demon Fruit to defeat his opponents, Hyouzou, one of Hody\u0027s seconds, swallows a large quantity of steroids while drinking alcohol. He quickly becomes uncontrollable and attacks his own allies, who are unable to dodge his fearsome sword blows. He soon sees the young archaeologist and decides to attack her. But Zoro intervenes and saves his friend\u0027s life by blocking Hyouzou\u0027s attack. While provoking him, the intrepid swordsman takes advantage of this moment to tell him that the fight he was about to undertake with him would be great training before heading for the New World, their next destination. At the same time, Luffy realizes that his attacks are ineffective when he\u0027s underwater. Yet, with Hody glaring at him, the Straw Hat vows to protect everyone, as he has been trained to do so for two long years.",
        "number": "n°560",
        "chapter": "Chap 639",
        "release_date": "2012-08-19",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 561,
        "title": "Battle royale! The crew against the new fish-men pirates",
        "description": "Luffy, with the help of King Neptune\u0027s three sons, tries his best to protect Princess Shirahoshi from the murderous madness of Hody Jones, the fearsome captain of the New Crew of Fishmen. Determined to kill Princess Mermaid, he had forgotten that Vander Decken was not quite dead. Although in bad shape, the captain of the Flying Dutchman was still conscious enough to keep the Noah afloat and continue to pursue Shirahoshi wherever she went. Meanwhile, the battle between the Straw Hats and Hody Jones\u0027s men continues to rage on Tuna Rope Square. Luffy\u0027s friends are fighting hard against super-powered enemies who have overdosed on steroid pills. They soon realize that they hold the fate of the inhabitants of Fishman Island in their hands. At the same time, Princess Shirahoshi\u0027s brothers shout at her to change direction and turn the Noah sideways. But Hody is having none of it and, waiting for Decken to breathe his last, pursues the princess by any means necessary. Princes Fukaboshi, Manboshi and Ryuboshi try to oppose him, but without much success. Just as Decken was about to take revenge on Hody by hurling an axe at him from inside the Noah, his strength failed him and he finally expired. As he died, his power disappeared with him, and soon the Noah began to slow down, then stop, before beginning a vertiginous fall towards the Isle of the Fish-Men!",
        "number": "n°561",
        "chapter": "Chap 640",
        "release_date": "2012-08-26",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 562,
        "title": "Luffy defeated!? Time for Hody\u0027s revenge",
        "description": "As the Noah heads inexorably towards Fishman Island, Shirahoshi tries to revive Decken, but is prevented from doing so by Hody, who attacks her. Her three brothers try to step in to defend their sister and Luffy, but all three are defeated by the dreaded steroid-doped Fishman. The Straw Hat is then forced to fight Hody, and chooses the Ark as the location for the confrontation. But knowing the young pirate\u0027s weakness, Hody destroys the air bubble enveloping the Noah, forcing Luffy to fight underwater. Just when all was lost, Prince Fukaboshi comes to the Straw Hat\u0027s rescue, saving him from certain death. Then, King Neptune\u0027s eldest son faced the captain of the New Crew of Fishmen in single combat. The battle was fierce, but Fukaboshi, for all his valour, was no match for such an adversary, who treacherously stabbed him to death before his sister\u0027s horrified eyes. Frightened, she obeys her wounded brother\u0027s orders to swim as far as possible with Luffy alongside the ark. For his part, thanks to a snail phone given to him by Prince Fukaboshi when he was with him, the Straw Hat receives a call from those in charge of the Air Tank above Fishman Island. They inform him that they have prepared a huge air bubble with all available reserves capable of completely enveloping the Noah. This procedure won\u0027t stop the ship\u0027s fall, but it can be easily deflected so it won\u0027t hit its target. What\u0027s more, those in charge of the Air Tank only have one shot at this, which they must not waste in vain. For his part, Hody, who hasn\u0027t yet guessed the Straw Hat\u0027s plan, attacks poor Shirahoshi again, but Luffy stands between the princess and the Fishman. After shattering his weapon, the Straw Hat delivers a lightning blow that infuriates Hody. Swallowing another dose of steroids, Hody suddenly transforms, becoming even bigger and more powerful. Just as he was about to attack him again, Luffy receives a call from Fukaboshi on his snail phone. In a weak voice, Shirahoshi\u0027s older brother tells him that he has discovered who Hody really is...",
        "number": "n°562",
        "chapter": "Chap 641-643",
        "release_date": "2012-09-02",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 563,
        "title": "The shocking truth! Hody\u0027s true identity",
        "description": "Before the Noah begins to fall on Fishman\u0027s Island, the battle between the Straw Hats and Hody Jones\u0027 troops rages on in Thon-corde Square. Together, Jinbe and Sanji continue their battle against Wadatsumi. The latter, unhappy at not being able to defeat such tiny opponents, gets angry and bloats up on steroids, unknowingly crushing his own allies with his hands. The Straw Hat Crew\u0027s cook had the mischievous pleasure of infuriating him further by telling him he was smaller than the Kraken. This morphological comparison exasperated Wadatsumi, who began to charge. Meanwhile, the Minister of the Right arrived on the battlefield with part of the royal army and was informed of the situation. He admits his mistake and immediately joins the Straw Hats and Jinbe with his own men. At the same time, Hammond, one of Hody\u0027s lieutenants, uses the human pirates enslaved by the Fishmen to attack Luffy\u0027s companions. But his plan is foiled by Robin, who uses her powers to free the human slaves. The latter immediately allied themselves with their saviors, making the fight even fiercer. But suddenly an alarm sounds on Fish Island! As the evacuation order is given, Luffy and Shirahoshi learn the truth about Hody Jones. The Man-Fish is driven by an ancestral hatred of humans, even though they have done nothing to him. After making this confession, Hody sneers before charging at Princess Mermaid and Straw Hat with bloodshot eyes, aiming to kill them.",
        "number": "n°563",
        "chapter": "Chap 642-643-644",
        "release_date": "2012-09-09",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 564,
        "title": "Starting all over again! Luffy\u0027s deepest wish!",
        "description": "Despite his injury, Prince Fukaboshi begins to recount Hody\u0027s past, and explains who this mysterious Fishman, who hated humans so much, really was. From their earliest childhood, the officers of the New Crew of Fishmen had always been taught that humans belonged to an inferior race, as they were unable to breathe underwater. Based on this argument, Hody and his crew vowed to wipe them all out to ensure the survival of their own species. And the more time passed, the more obsessed they became with the idea. So much so that Hody enlisted with his men in the ranks of the royal army. They committed many crimes, and even celebrated the death of Queen Otohime, who was determined to bring humans and Fishmen closer together. It was at this time that the captain of the New Fishmen Crew began to consume and produce large doses of steroids, which were to guarantee him even greater power in the years to come. After these revelations, Fukaboshi, with tears in his eyes, laments the circumstances that led to the death of his beloved mother. His hatred of humans has done far too much harm to his people, and he wants to make amends. He begs Luffy\u0027s forgiveness before joining him to fight Hody Jones\u0027 murderous insanity. The Straw Hat, happy with this alliance, prepares to fight Hody again after learning that the Air Tank is ready to launch a huge air bubble completely surrounding the Noah before it crashes on Fishman\u0027s Island. Meanwhile, Luffy\u0027s friends continue their respective battles against Hody Jones\u0027 lieutenants alongside Jinbe, who fights like a lion.",
        "number": "n°564",
        "chapter": "Chap 5642-644",
        "release_date": "2012-09-16",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 565,
        "title": "Luffy attacks with all his might! The Red Hack explosion",
        "description": "The fight between Luffy and Hody grows increasingly furious. The Straw Hat employs a new fighting technique combining Haki and the powers of his Demon Fruit to send his opponent flying into the Noah. This is the Red Hawk, in memory of Ace, his beloved brother who died in Marineford. But the ship continues to fall, still threatening the lives of everyone on the Isle of Fishmen. At the same time, in Tuna Rope Square, the Straw Hats use their most ferocious attacks to defeat Hody\u0027s steroid-doped men. Brook engages in his fierce battle with his opponent, as do Franky and Usopp, far more confident than he was before. For his part, Chopper, after biting into a Rumble Ball, transforms into a monster, but retains his sanity. Meanwhile, on the Noah, Hody comes to his senses. After getting to his feet, he sees Luffy approaching, standing proudly in front of him. Sneering and once again insulting his opponent for being such a common human being, the captain of the New Crew of the Fishmen prepares for battle once again, after swallowing another dose of steroids that once again make him lose his mind.",
        "number": "n°565",
        "chapter": "Chap 643-644-645",
        "release_date": "2012-09-23",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 566,
        "title": "It\u0027s all over! Hody\u0027s decisive battle",
        "description": "Made even more powerful by this new dose of steroids, Hody hits Luffy hard, making him bite the dust. But the Straw Hat doesn\u0027t admit defeat. Recovering quickly from his injuries, he once again uses the Red Hawk to weaken his opponent. But Luffy is surprised to see Hody still standing after this powerful attack. Meanwhile, Chopper reveals to his friends that he can reach Monster Point by crunching just one Rumble Ball. After this revelation, Usopp, Franky, Sanji and Jinbe are about to finish their fight with their respective opponents. Meanwhile, Luffy, far from demoralized, attacks Hody again, using a new fighting technique - the Elephant Gatling Gun - to finally knock out his enemy. But time is running out, as the Noah is about to crash on Fish Island. Knowing what would happen to his friends if he did nothing, Luffy evacuates the unconscious Hody, then once again uses the Elephant Gatling Gun to destroy the ark before it completely annihilates the Ryugu Kingdom!",
        "number": "n°566",
        "chapter": "Chap 645-646",
        "release_date": "2012-09-30",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 567,
        "title": "Stop Noah! The Elephant Gatling of despair!",
        "description": "Luffy is forced to destroy the Noah with the Gigant Elephant Gatling Gun before the ship smashes into Fishman\u0027s Island. At the same time, all Hody Jones\u0027 men have been defeated and are fleeing from the Noah, which is approaching dangerously close to them. For their part, the royal authorities, who have regained control of the Ryugu Kingdom, try to speed up the evacuation of the island, but to no avail. Thinking their end was near, the inhabitants all remembered the human who had protected them 20 years ago: Whitebeard, an old friend of King Neptune\u0027s, whose valour bore a striking resemblance to that of Luffy. With the support of his crew, the islanders and Neptune\u0027s men, Luffy continues to destroy the Noah with a vengeance, while feeling the wound from his last battle with Hody reopen and draw blood. Princess Shirahoshi helplessly watches Luffy\u0027s determined attacks. As the Straw Hat gradually loses its strength, the Sea Kings, gigantic sea monsters summoned by Shirahoshi, arrive to stop the Noah in its tracks by pulling on its mooring chains. Luffy, exhausted, faints and falls into the wreckage of the ark, losing a lot of blood. At the same time, on Fish Island, everyone notices that the Noah has stopped falling and finally understands that all danger has finally been averted. Overjoyed at this outcome, the inhabitants of Ryugu Kingdom rejoice and celebrate with dignity the feat of the Straw Hat, who had saved their island at the risk of his own life, thus contradicting Madame Shirley\u0027s dire prediction.",
        "number": "n°567",
        "chapter": "Chap 645-647",
        "release_date": "2012-10-07",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 568,
        "title": "For the future! The road to the Sun!",
        "description": "After this unprecedented feat, Princess Shirahoshi reveals herself to be the \u0022Queen\u0022 of the Sea Kings, as she can speak freely with them. Seeing that the Straw Hat was in a bad way, she quickly went to the aid of Luffy, who had fainted after the Noah had stopped. Meanwhile, King Neptune\u0027s guards have managed to find the missing mermaids safe and sound at Ryugu Palace, but no trace of their kidnapper, the infamous Caribou. King Neptune and his entire family beg forgiveness for falsely accusing the Straw Hats. Meanwhile, Luffy is finally brought back to Fish Island, but urgently needs a blood transfusion (group F) to be saved. However, none of the island\u0027s inhabitants are willing to respond to the Straw Hat Crew\u0027s distress, as the law prohibits this exchange between humans and Fishmen. Just when everyone thought Luffy\u0027s fate was sealed, Jinbe steps out of the shadows and, as a pirate (and therefore an outlaw), offers to donate his blood to save his friend\u0027s life. Thanks to this initiative, Luffy gradually regains his color, and it\u0027s with his big smile that he asks his savior to join his crew.",
        "number": "n°568",
        "chapter": "Chap 648",
        "release_date": "2012-10-14",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 569,
        "title": "A secret revealed! The truth about ancient weapons",
        "description": "Everyone on Fishman\u0027s Island celebrates the Straw Hats\u0027 victory over Hody Jones\u0027 men. Embarrassed by such popularity, Luffy and his friends leave Tuna Rope Square. Indeed, Luffy and Zoro are afraid of being considered heroes, and thus of sharing food and sake with the rest of the inhabitants. A little later aboard the Sunny, Jinbe politely rebuffs Luffy\u0027s proposal, telling him that he still has things to take care of in Ryugu Kingdom. However, he promises to come and meet him when all this is settled, and will join his crew if Luffy is still willing. Suddenly, Princess Shirahoshi and a royal soldier invite the Straw Hats to the palace to celebrate their victory over Hody Jones. The whole island goes out of its way to offer the pirates a banquet worthy of the name. While the party is in full swing, Robin isolates himself with King Neptune to talk to him about something important. Two years ago, on the celestial island of Skypiéa, the young archaeologist had discovered that a Poneglyph lurked on the Isle of the Fish-Men. It was this inscription that she had previously read while in the Marine Forest. Robin then mentions what she had discovered: there was once a Mermaid Princess who had the gift of being able to control the Sea Kings, powerful sea creatures. It seems that Shirahoshi has inherited this power. Yet the Poneglyph concealed other equally disturbing information: one concerned Noah\u0027s Ark, and another dealt with the life of a mysterious character named Joy Boy, who was said to have a close link with Poseidon, one of the three famous great ancient Weapons...",
        "number": "n°569",
        "chapter": "Chap 649",
        "release_date": "2012-10-21",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 570,
        "title": "The crew is surprised! The new Chief Admiral of the Navy",
        "description": "The members of the Straw Hat Crew are celebrating. Jinbe takes advantage of this moment to tell them about the battle between two Navy Admirals vying for the position vacated by Sengoku. Everyone is surprised to learn that Akainu has become the new Chief Admiral in place of Aokiji. King Neptune talks to his daughter Shirahoshi and Robin about the Poneglyphs found in the Marine Forest and explains all he knows about the Ancient Weapons. But their conversation is overheard by Caribou, who has managed to evade the guards\u0027 vigilance. The bandit discreetly takes advantage of this to head for the young princess\u0027s room, with the aim of kidnapping her using the powers of his Demon Fruit and selling her back to Sabaody for a very good price. But his plan is foiled and Luffy manages to chase him off, much to everyone\u0027s relief. But Caribou had time to steal the treasures from the Ryugu Palace under the very noses of the guards. Meanwhile, in the Palace\u0027s gaols, a strange metamorphosis is taking place in Hody Jones\u0027 men and in himself. Under the effect of the steroids they had taken in excess, they had aged considerably, but still retained their hatred of the royal family and humans. Neptune explained to his guests the dangerous side effects of these energy pills, which were not to be misused. After this unfortunate incident, the party continues in full swing until the arrival of two of Big Mom\u0027s emissaries, Baron Tamago and Pekoms, who demand sweets for their captain. Otherwise, the protector of Fishman Island would destroy the Ryugu Kingdom if she wasn\u0027t given these precious treats immediately!",
        "number": "n°570",
        "chapter": "Chap 650",
        "release_date": "2012-10-28",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 571,
        "title": "She loves candy! The Big Mom emperor!",
        "description": "Luffy, Zoro and Sanji manage to recover the treasures Caribou had stolen. On their way back to Ryugu Palace, they run into Tamago and Pekoms, the two henchmen of Big Mom, one of the Four Emperors. When she learns that Luffy has eaten all the sweets promised to her, Big Mom goes berserk and declares over the snail phone that she\u0027ll destroy Fishman Island if they don\u0027t give her what she wants. The Straw Hat tries to find common ground with her by offering her all the treasures Caribou had stolen. But Big Mom refuses, preferring to confront the young pirate when he comes to the New World. Luffy accepts her proposal, declaring that he will never leave Fish Island in Big Mom\u0027s hands, as he will make it his new territory...",
        "number": "n°571",
        "chapter": "Chap 651",
        "release_date": "2012-11-04",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 572,
        "title": "Dark prospects! A trap awaits in the New World!",
        "description": "The Minister of the Right warmly thanks the Straw Hats for saving Fish Island. At the same time, Jinbe tells King Neptune that the Sun Pirates have allied themselves with Big Mom, whereas he would rather cut ties with her. But there\u0027s another problem. The Tamate Box, stolen by Hody ten years ago, is now in Luffy\u0027s hands. But the Minister of the Right, fearing another theft, had filled it with explosives at the time. He feared that Luffy\u0027s attempt to open it would cause the contents to explode. For his part, Caribou, still on the run, went in search of the treasures Luffy had taken from him and discovered that they were now the property of Pekoms and Tamago, without knowing that it was the Straw Hat himself who had given them to their captain, the terrible Big Mom, so that she wouldn\u0027t destroy the Ryugu Kingdom, to the great displeasure of King Neptune and Nami, who dreamed of acquiring all this fortune. Claiming that these treasures were rightfully his, Caribou challenged Pekoms to a duel. But the forban is quickly defeated by Big Mom\u0027s henchman, who easily crushes him with a well-felt punch to the stomach. After this incident, Luffy and his friends are escorted to the main port of Ryugu Kingdom in the company of King Neptune on his whale Hoe, Princes Fukaboshi, Ryuboshi and Manboshi and Princess Shirahoshi riding her shark Megalo. As they are hailed as heroes, the Straw Hat is overjoyed to see Franky aboard the Sunny, decked out and ready to go again. Meanwhile, on the surface of the oceans near Red Line in the New World, a fierce battle is taking place between the G-5 Navy and pirates whose ships are mysteriously emerging from the depths of the sea. Vice-Admiral Smoker, assisted by his loyal Tashigi, has taken command of the Navy\u0027s ships. He interrogates the pirates he has just captured. They turn out to be former prisoners enslaved by Hody Jones of the Fishman District. Threatened, one of them confesses to Smoker that he and his men have been freed thanks to the Crew of the Straw Hat, a piece of information that doesn\u0027t surprise the phlegmatic naval officer, who immediately gets back on the hunt.",
        "number": "n°572",
        "chapter": "Chap 652",
        "release_date": "2012-11-11",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 573,
        "title": "Final departure! Island of the Fish-Men!",
        "description": "Camie and all the employees of the Café des Sirènes ask their boss, Madame Shirley, for permission to go to the port to bid farewell to the Straw Hats, who are about to leave Fishman\u0027s Island. Madame Shirley grants them this favor, saying that her prediction that Luffy would destroy the Ryugu Kingdom had not come true, as he and his friends had defeated Hody Jones and the fearsome pirates of the New Fishmen\u0027s Crew. Meanwhile, Shirahoshi cries her eyes out knowing she\u0027ll never see her friends again, and asks the Straw Hats not to leave. But Luffy tells her it\u0027s not possible. Sunny is ready to weigh anchor. The Straw Hat gives the signal for departure. For their part, Usopp and Chopper complain that they will soon die in the New World, frightened by the idea that they were going to be killed by Big Mom because of the Tamate Box. The mermaids and the whole Isle of Fishmen say goodbye to their saviors, whose memory will remain forever in their hearts. Before leaving, Nami receives a wonderful gift from the hands of the Minister of the Left: a three-needle Log Pose that will make it easier for the young woman to navigate the raging waves of the New World. It\u0027s time to say farewell, and soon the Straw Hat Crew\u0027s ship pulls away from the island\u0027s shores. Princess Shirahoshi, in tears, joins them. Moved to tears, the whole crew makes her a solemn promise to return soon to Fish Island to visit the lush green forests she has longed to see since she was a little girl...",
        "number": "n°573",
        "chapter": "Chap 653",
        "release_date": "2012-11-18",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    },
    {
        "id": 574,
        "title": "To the New World! Eyes on the biggest sea!",
        "description": "Having left Fishman\u0027s Island, the Straw Hat Pirates begin their ascent to the New World. Nami takes advantage of this respite to take a shower and relax. Chopper assures her that he will prevent Sanji and Brook from watching the young woman bathe. Meanwhile, Luffy, Zoro and Usopp attempt to catch a large deep-sea fish to eat. But their plan falls through, as their ship is soon sucked into a huge whirlpool that sweeps them away. They owe their salvation to a school of whales who, thanks to Brook\u0027s melodious songs, help them to the surface. There, suddenly emerging from the water, the Sunny faces a raging sea, and is soon surrounded by several Navy warships armed to the teeth...",
        "number": "n°574",
        "chapter": "Chap 654-655",
        "release_date": "2012-11-25",
        "arc": {
            "id": 37,
            "title": "Arc Île des Hommes-Poissons",
            "description": "Luffy and his crew head to the bottom of the sea to reach the island of the Fishmen and confront Hody Jones and the new Fishmen crew.",
            "saga": {
                "id": 7,
                "title": "Île des Hommes-Poissons",
                "saga_number": "7",
                "saga_chapitre": "598 à 653",
                "saga_volume": "62 à 66",
                "saga_episode": "517 à 574"
            }
        },
        "saga": {
            "id": 7,
            "title": "Île des Hommes-Poissons",
            "saga_number": "7",
            "saga_chapitre": "598 à 653",
            "saga_volume": "62 à 66",
            "saga_episode": "517 à 574"
        }
    }
]